Revit 2018 API
IndexBuffer Members
The IndexBuffer type exposes the following members.
Constructors
Name | Description
IndexBuffer
 Constructs the index buffer with the given capacity, measured in short integers.
Methods
Name | Description
Dispose
Releases all resources used by the IndexBuffer
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetIndexStreamLine
 Gets a stream that can be used to write line segment primitives into the buffer.
GetIndexStreamPoint
 Gets a stream that can be used to write point primitives into the buffer.
GetIndexStreamTriangle
 Gets a stream that can be used to write triangle primitives into the buffer.
GetMappedHandle
 Gets a handle to the buffer's memory that has been mapped. Writing data to the buffer using the handle is an alternative to using stream objects.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValid
 Tests whether the buffer is valid for rendering.
Map
 Maps a portion of the buffer into memory, so that indices can be written into it (see Autodesk::Revit::DB::DirectContext3D::VertexStream).
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Unmap
 Unmaps the buffer so that it can be used for rendering.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
IndexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace